package com.yundao.workflow.constant;

/**
 * Created by gjl on 2017/6/23.
 */
public interface CodeConstant {
	 /**
     * 业务值已存在
     */
    int CODE_1100000 = 1100000;
    /**
     * 资源名字有误
     */
    int CODE_1100001 = 1100001;
    /**
     * 资源名不能为空
     */
    int CODE_1100002 = 1100002;
    /**
     * 任务ID不能为空
     */
    int CODE_1100003 = 1100003;
    /**
     * 任务不存在
     */
    int CODE_1100004 = 1100004;
    /**
     * 您暂无权限操作
     */
    int CODE_1100005 = 1100005;
    /**
     * 任务id有误
     */
    int CODE_1100006 = 1100006;
    /**
     * 任务已被他人领取
     */
    int CODE_1100007 = 1100007;
    /**
     * 业务值流程实例不存在
     */
    int CODE_1100008 = 1100008;
    /**
     * 当前流程bpmn文件不存在
     */
    int CODE_1100009 = 1100009;
    /**
     * 业务值不能为空
     */
    int CODE_1100010 = 1100010;
    /**
     * 流程executionID为空
     */
    int CODE_1100011 = 1100011;
    /**
     * 流程启动时，execution对象为空
     */
    int CODE_1100012 = 1100012;
    /**
     * 用户组类型不能为空
     */
    int CODE_1100013 = 1100013;
    /**
     * 流程初始化数据格式不正确
     */
    int CODE_1100014 = 1100014;
    /**
     * 流程启动有误
     */
    int CODE_1100015 = 1100015;
    /**
     * 请指定流程节点(Assignee)参数
     */
    int CODE_1100016 = 1100016;
    /**
     * 操作类型不能为空
     */
    int CODE_1100017 = 1100017;
    /**
     * 角色ID不能为空
     */
    int CODE_1100018 = 1100018;
    /**
     * 动作值不能为空
     */
    int CODE_1100019 = 1100019;
    /**
     * 流程实例不存在
     */
    int CODE_1100020 = 1100020;
    
    /**
     * 没有找到任务的申请人
     */
    int CODE_1100021 = 1100021;
    
    /**
     * 只有发起人才能取消任务
     */
    int CODE_1100022 = 1100022;
    
}
